In [1]:
import pandas as pd

## In pandas we have 2 main datatypes

### 1. Series (1-dimentional)

In [3]:
models = pd.Series(["BMW", "Ford", "Toyota"])
models

0       BMW
1      Ford
2    Toyota
dtype: object

In [4]:
colors = pd.Series(["Black", "Red", "White"])
colors

0    Black
1      Red
2    White
dtype: object

### 2. Dataframes (2-dimentional)

In [5]:
dataframe = pd.DataFrame({"Car Make": models, "Color": colors})
dataframe

  Car Make  Color
0      BMW  Black
1     Ford    Red
2   Toyota  White

## Importing data

In [6]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Exporting data

In [7]:
car_sales.to_csv("exported_car_sales.csv", index=False)

In [8]:
# Reading the exported data again
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00